---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData.LinkIndex
source: html/f563a559-a19b-373d-90ea-4ce6b088e801.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData.LinkIndex Property

The index of the connector which is linked with this connector

## Syntax (C#)
```csharp
public int LinkIndex { get; }
```